#ifndef strcpy_h__
#define strcpy_h__

///////////////////////////////////////////////////////////////////////////////////////////////////

namespace apilib
{
  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//

  /**
   *  опирование строки.
   *
   * @param dst  конечна€ строка.
   * @param src  исходна€ строка.
   *
   * @return  длина модифицированной конечной строки без учета нулевого символа,
   *          0 в случае ошибки.
  */
  size_t strcpy_a(char* dst, const char* src);
  size_t strcpy_w(wchar_t* dst, const wchar_t* src);

  /**
   *  опирование строки.
   *
   * @param dst     конечна€ строка.
   * @param src     исходна€ строка.
   * @param maxcnt  максимальное количество копируемых символов исходной строки.
   *
   * @return  длина модифицированной конечной строки без учета нулевого символа,
   *          0 в случае ошибки.
  */
  size_t strcpy_na(char* dst, const char* src, size_t maxcnt);
  size_t strcpy_nw(wchar_t* dst, const wchar_t* src, size_t maxcnt);

  /**
   *  опирование строки.
   *
   * @param dst     конечна€ строка.
   * @param src     исходна€ строка.
   * @param maxlen  максимальна€ длина конечной строки с учетом нулевого символа.
   *
   * @return  требуема€ длина конечной строки без учета нулевого символа,
   *          требуема€ длина >= maxlen означает недостаточный размер буфера,
   *          0 в случае ошибки.
  */
  size_t strcpy_la(char* dst, const char* src, size_t maxlen);
  size_t strcpy_lw(wchar_t* dst, const wchar_t* src, size_t maxlen);

  /**
   *  опирование строки.
   *
   * @param dst     конечна€ строка.
   * @param src     исходна€ строка.
   * @param maxlen  максимальна€ длина конечной строки с учетом нулевого символа.
   * @param maxcnt  максимальное количество копируемых символов исходной строки.
   *
   * @return  требуема€ длина конечной строки без учета нулевого символа,
   *          требуема€ длина >= maxlen означает недостаточный размер буфера,
   *          0 в случае ошибки.
  */
  size_t strcpy_lna(char* dst, const char* src, size_t maxlen, size_t maxcnt);
  size_t strcpy_lnw(wchar_t* dst, const wchar_t* src, size_t maxlen, size_t maxcnt);

  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
};

///////////////////////////////////////////////////////////////////////////////////////////////////

#endif // strcpy_h__