#ifndef strlen_h__
#define strlen_h__

///////////////////////////////////////////////////////////////////////////////////////////////////

namespace apilib
{
  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//

  /**
   * Определение длины строки.
   *
   * @param string  строка.
   * 
   * @return  в случае успеха - длина строки,
   *          в случае ошибки - 0.
  */
  size_t strlen_a(const char* s);
  size_t strlen_w(const wchar_t* s);

  /**
   * Определение длины строки.
   *
   * @param string  строка.
   * @param maxlen  максимальная длина строки с учетом нулевого символа.
   * 
   * @return  в случае успеха - длина строки,
   *          в случае ошибки - 0.
  */
  size_t strlen_na(const char* s, size_t maxlen);
  size_t strlen_nw(const wchar_t* s, size_t maxlen);
  
  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
};

///////////////////////////////////////////////////////////////////////////////////////////////////

#endif // strlen_h__