#ifndef memfind_h__
#define memfind_h__

///////////////////////////////////////////////////////////////////////////////////////////////////

namespace apilib
{
  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//

  /**
   * Поиск данных в участке памяти.
   *
   * @param mem       участок памяти.
   * @param mem_size  размер участка памяти.
   * @param data      данные.
   * @param data_size размер данных.
   *
   * @return найденные данные в случае успеха,
   *         NULL если данные не найдены или произошла ошибка.
  */
  void* memfind(const void* mem, size_t mem_size, const void* data, size_t data_size);

  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
};

///////////////////////////////////////////////////////////////////////////////////////////////////

#endif // memfind_h__