#ifndef memset_h__
#define memset_h__

///////////////////////////////////////////////////////////////////////////////////////////////////

namespace apilib
{
  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//

  /**
   * Заполнение участка памяти значением.
   *
   * @param dst  участок памяти.
   * @param val  значение которым заполняется участок памяти.
   * @param size размер участка памяти.
   *
   * @return true в случае успеха, false в случае ошибки.
  */
  bool memset(void* dst, unsigned char val, size_t size);

  /**
   * Заполнение участка памяти нулями.
   *
   * @param dst  участок памяти.
   * @param size размер участка памяти.
   *
   * @return true в случае успеха, false в случае ошибки.
  */
  bool memzero(void* dst, size_t size);

  //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
};

///////////////////////////////////////////////////////////////////////////////////////////////////

#endif // memset_h__